<?php

return [
    'boolean' => '«:attribute» դաշտը պետք է լինի այո կամ ոչ։',
    'confirmed' => 'Գաղտնաբառերը չեն համընկնում։',
    'current_password' => 'Ընթացիկ գաղտնաբառը սխալ է։',
    'email' => 'Նշեք ճիշտ email։',
    'exists' => '«:attribute» դաշտի ընտրված արժեքը չի գտնվել։',
    'in' => '«:attribute» դաշտում ընտրված է անթույլատրելի արժեք։',
    'integer' => '«:attribute» դաշտը պետք է լինի ամբողջ թիվ։',
    'max' => [
        'numeric' => '«:attribute» դաշտը չի կարող մեծ լինել :max-ից։',
        'string' => '«:attribute» դաշտը չի կարող գերազանցել :max նիշը։',
    ],
    'min' => [
        'numeric' => '«:attribute» դաշտը պետք է լինի առնվազն :min։',
        'string' => '«:attribute» դաշտը պետք է պարունակի առնվազն :min նիշ։',
    ],
    'password' => [
        'letters' => 'Գաղտնաբառը պետք է պարունակի առնվազն մեկ տառ։',
        'mixed' => 'Գաղտնաբառը պետք է պարունակի մեծատառ և փոքրատառ տառեր։',
        'numbers' => 'Գաղտնաբառը պետք է պարունակի առնվազն մեկ թվանշան։',
        'symbols' => 'Գաղտնաբառը պետք է պարունակի առնվազն մեկ նշան։',
        'uncompromised' => 'Այս գաղտնաբառը հայտնվել է արտահոսքերում։ Ընտրեք այլ գաղտնաբառ։',
    ],
    'required' => 'Լրացրեք «:attribute» դաշտը։',
    'string' => '«:attribute» դաշտը պետք է լինի տեքստ։',
    'unique' => '«:attribute» դաշտի այս արժեքն արդեն օգտագործվում է։',
    'url' => '«:attribute» դաշտը պետք է լինի հղում (https://…)։',

    'attributes' => [
        'email' => 'email',
        'password' => 'գաղտնաբառ',
        'name' => 'անուն',
        'phone' => 'հեռախոս',
    ],
];
